# encoding=utf8  
import sys  

reload(sys)  
sys.setdefaultencoding('utf8')  

TYPE3MAP = {
    1918:u'苏菜', 1908:u'浙菜', 2068:u'巴西菜', 181:u'中东菜', 2086:u'粥粉面馆', 2075:u'奥地利菜', 169:u'自助海鲜', 1907:u'绍兴菜', 2098:u'地方小吃', 2016:u'西式快餐', 666:u'生鲜', 2061:u'英国菜', 2002:u'酸菜鱼', 2073:u'秘鲁菜', 2080:u'黎巴嫩菜', 2107:u'凉皮肉夹馍', 251:u'粥粉面馆', 247:u'印度菜', 13:u'冰淇淋', 2089:u'炸鸡炸串', 2189:u'西式快餐', 2110:u'奶茶/果汁', 1999:u'自贡盐帮菜', 2074:u'爱尔兰菜', 1916:u'大闸蟹', 2108:u'地方小吃', 1961:u'炸酱面', 220:u'本地烤肉', 2077:u'加勒比菜', 2009:u'福州菜', 2067:u'墨尔本美食', 214:u'生煎锅贴', 2091:u'粥粉面馆', 2070:u'墨西哥菜', 2072:u'摩洛哥菜', 2014:u'浙菜', 1902:u'甜品', 2102:u'地方小吃', 2060:u'Brunch', 318:u'韩式烤肉', 2118:u'湛江菜', 1903:u'甜品', 2066:u'希腊菜', 1905:u'宁波菜', 1940:u'牛排', 2079:u'瑞士菜', 1910:u'浙菜', 2092:u'过桥米线', 1913:u'苏菜', 2097:u'地方小吃', 171:u'自助烧烤', 2078:u'克罗地亚菜', 1938:u'西式快餐', 2101:u'地方小吃', 2082:u'饺子馄钝', 2034:u'闽西菜', 2013:u'小火锅', 2081:u'非洲菜', 1900:u'甜品', 1921:u'川味火锅', 2083:u'饺子馄钝', 2000:u'江湖菜', 1917:u'苏菜', 2076:u'波兰菜', 2099:u'地方小吃', 1925:u'牛肉火锅', 662:u'栗子/干果', 2120:u'烧腊', 1848:u'汉堡', 1923:u'海鲜火锅', 246:u'泰国菜', 242:u'羊蝎子', 317:u'铁板烧', 1922:u'川味火锅', 1901:u'甜品', 2049:u'官府菜', 1915:u'苏菜', 2071:u'土耳其菜', 245:u'新加坡菜', 2087:u'麻辣烫', 2015:u'无锡菜', 2096:u'地方小吃', 2064:u'葡萄牙菜', 2117:u'顺德菜', 183:u'粥粉面馆', 2043:u'烤翅', 660:u'零食', 2044:u'烤串', 170:u'日式自助', 2093:u'生煎锅贴', 2069:u'巴斯克菜', 2032:u'烤鱼', 1997:u'本帮菜', 2088:u'小龙虾', 1914:u'淮扬菜', 665:u'水果', 2114:u'燕翅鲍', 2008:u'马来西亚菜', 2095:u'鸭脖卤味', 322:u'西班牙菜', 2094:u'粥粉面馆', 256:u'甜品', 2065:u'德国菜', 2100:u'地方小吃', 2063:u'地中海菜', 313:u'韩式火锅', 1939:u'比萨', 1909:u'浙菜', 1906:u'浙菜', 2033:u'闽南菜', 2001:u'香锅', 2116:u'广州菜', 19:u'法国菜', 2040:u'寿司', 2090:u'鸭脖卤味', 179:u'甜品', 2062:u'美国菜', 310:u'俄罗斯菜', 2119:u'潮州菜', 321:u'越南菜', 1911:u'浙菜', 252:u'羊汤羊杂', 316:u'拉美烧烤', 210:u'自助火锅', 233:u'客家菜', 239:u'涮羊肉', 241:u'鱼火锅', 1904:u'杭帮菜', 661:u'保健品', 1912:u'南京菜', 20:u'意大利菜', 1993:u'烤鸭', 2115:u'茶餐厅', 172:u'自助披萨', 238:u'云南火锅', 153:u'串串香', 11:u'中式快餐', 239:u'老北京涮羊肉'
}

TYPE2MAP = {
    10:u'小吃快餐', 170:u'自助餐', 232:u'台湾菜', 298:u'江西菜', 1902:u'甜点饮品', 302:u'西藏菜', 202:u'自助餐', 2053:u'其它', 255:u'食品保健', 2045:u'家常菜', 2110:u'甜点饮品', 2051:u'清真菜', 299:u'山西菜', 230:u'湘菜', 2113:u'甜点饮品', 120:u'私房菜', 262:u'咖啡厅', 2048:u'其它', 175:u'东北菜', 23:u'日韩料理', 2055:u'其它', 30:u'江浙菜', 13:u'甜点饮品', 300:u'徽菜', 1900:u'甜点饮品', 24:u'日韩料理', 2189:u'小吃快餐', 2162:u'河北菜', 319:u'粤菜', 2050:u'其它', 1901:u'甜点饮品', 309:u'西餐', 256:u'甜点饮品', 301:u'闽菜', 318:u'日韩料理', 201:u'火锅', 308:u'东南亚菜', 2054:u'其它', 229:u'川菜', 316:u'西餐', 239:u'北京菜', 2088:u'小龙虾', 257:u'水果生鲜', 1961:u'北京菜', 210:u'火锅', 2112:u'甜点饮品', 12:u'蛋糕', 1903:u'甜点饮品', 315:u'烧烤', 184:u'其它', 304:u'海南菜', 174:u'西北菜', 16:u'素菜', 303:u'河南菜', 2049:u'北京菜', 179:u'甜点饮品', 2052:u'其它', 307:u'广西菜', 171:u'烧烤', 228:u'山东菜', 9:u'海鲜', 27:u'北京菜', 235:u'新疆菜', 223:u'创意菜', 170:u'日韩料理', 2047:u'其它', 231:u'湖北菜', 2111:u'甜点饮品', 2087:u'川菜', 2166:u'云贵菜', 306:u'天津菜', 2046:u'农家菜'
}

FRONT_TYPE2_ID_NAME = {
    u'徽菜': 1, u'家常菜': 2, u'川菜': 3, u'海鲜': 4, u'闽菜': 5, u'广西菜': 6, u'其它': 7, u'食品保健': 8, u'北京菜': 9, u'台湾菜': 10, u'东南亚菜': 11, u'私房菜': 12, u'山西菜': 13, u'东北菜': 14, u'水果生鲜': 15, u'咖啡厅': 16, u'小龙虾': 17, u'山东菜': 18, u'日韩料理': 19, u'江西菜': 20, u'小吃快餐': 21, u'湘菜': 22, u'西餐': 23, u'自助餐': 24, u'素菜': 25, u'湖北菜': 26, u'西藏菜': 27, u'蛋糕': 28, u'河南菜': 29, u'河北菜': 30, u'新疆菜': 31, u'云贵菜': 32, u'火锅': 33, u'创意菜': 34, u'清真菜': 35, u'粤菜': 36, u'江浙菜': 37, u'烧烤': 38, u'农家菜': 39, u'西北菜': 40, u'甜点饮品': 41, u'海南菜': 42, u'天津菜': 43
}

FRONT_TYPE3_ID_NAME = {
    u'新加坡菜': 201, u'星级酒店自助': 202, u'甜品': 203, u'摩洛哥菜': 204, u'土耳其菜': 205, u'燕翅鲍': 206, u'烧腊': 207, u'马来西亚菜': 208, u'0': 209, u'自贡盐帮菜': 210, u'葡萄牙菜': 211, u'宁波菜': 212, u'非洲菜': 213, u'生鱼片': 214, u'饺子馄钝': 215, u'大闸蟹': 216, u'粥粉面馆': 217, u'串串香': 218, u'香锅': 219, u'湛江菜': 220, u'泰国菜': 221, u'保健品': 222, u'奶茶/果汁': 223, u'比萨': 224, u'烤鱼': 225, u'潮州菜': 226, u'川味火锅': 227, u'羊蝎子': 228, u'韩式烤肉': 229, u'铁板烧': 230, u'西班牙菜': 231, u'羊汤羊杂': 232, u'水果': 233, u'杭帮菜': 234, u'福州菜': 235, u'官府菜': 236, u'墨西哥菜': 237, u'酸菜鱼': 238, u'苏菜': 239, u'巴西菜': 240, u'自助海鲜': 241, u'绍兴菜': 242, u'江湖菜': 243, u'意大利菜': 244, u'浙菜': 245, u'墨尔本美食': 246, u'英国菜': 247, u'自助披萨': 248, u'爱尔兰菜': 249, u'法国菜': 250, u'云南火锅': 251, u'拉美烧烤': 252, u'闽南菜': 253, u'淮扬菜': 254, u'凉皮肉夹馍': 255, u'越南菜': 256, u'自助烧烤': 257, u'日式自助': 258, u'闽西菜': 259, u'烤翅': 260, u'黎巴嫩菜': 261, u'印度菜': 262, u'自助火锅': 263, u'南京菜': 264, u'希腊菜': 265, u'生煎锅贴': 266, u'过桥米线': 267, u'本地烤肉': 268, u'生鲜': 269, u'广州菜': 270, u'俄罗斯菜': 271, u'西式快餐': 272, u'中东菜': 273, u'美国菜': 274, u'地中海菜': 275, u'鱼火锅': 276, u'克罗地亚菜': 277, u'地方小吃': 278, u'加勒比菜': 279, u'韩式火锅': 280, u'老北京涮羊肉': 281, u'本帮菜': 282, u'海鲜火锅': 283, u'无锡菜': 284, u'烤串': 285, u'冰淇淋': 286, u'德国菜': 287, u'炸酱面': 288, u'顺德菜': 289, u'栗子/干果': 290, u'涮羊肉': 291, u'茶餐厅': 292, u'小龙虾': 293, u'小火锅': 294, u'波兰菜': 295, u'烤鸭': 296, u'焖锅': 297, u'中式快餐': 298, u'Brunch': 299, u'瑞士菜': 300, u'零食': 301, u'秘鲁菜': 302, u'鸭脖卤味': 303, u'汉堡': 304, u'奥地利菜': 305, u'客家菜': 306, u'炸鸡炸串': 307, u'牛肉火锅': 308, u'巴斯克菜': 309, u'寿司': 310, u'麻辣烫': 311, u'牛排': 312
}

def process(input):

    for line in input:
        try:
            cols = line.strip().split("\t")
            assert (len(cols) == 3)
        except Exception:
            sys.stderr.write("Error: Split error!!! \n")
            continue

        try:
            if int(cols[1]) in TYPE2MAP.keys():
                front_cate2_name = TYPE2MAP[int(cols[1])]
            elif int(cols[2]) in TYPE2MAP.keys():
                front_cate2_name = TYPE2MAP[int(cols[2])]
            else:
                continue

            if front_cate2_name in FRONT_TYPE2_ID_NAME.keys():
                front_cate2_id = FRONT_TYPE2_ID_NAME[front_cate2_name]
            else:
                front_cate2_id = -1

            front_cate3_name = ''
            if int(cols[2]) in TYPE3MAP.keys():
                front_cate3_name = TYPE3MAP[int(cols[2])]

            if front_cate3_name in FRONT_TYPE3_ID_NAME.keys():
                front_cate3_id = FRONT_TYPE3_ID_NAME[front_cate3_name]
            else:
                front_cate3_name=front_cate2_name
                front_cate3_id = front_cate2_id

            print "%s\t%s\t%s\t%s\t%s\t%s" % (str(cols[0]),str(front_cate2_id),str(front_cate2_name),str(front_cate3_id),str(front_cate3_name),str(1.0))
            
        except Exception, e:
            sys.stderr.write(str(e))
            sys.stderr.write("Error: Input error!!!\n")
            continue

if __name__ == '__main__':
    process(sys.stdin)