# encoding=utf8
import sys

reload(sys)
sys.setdefaultencoding('utf8')

POINAME_MAP = {'羊': ['其他火锅', '涮羊肉', '蝎子'], '牛': ['其他火锅', '牛肉火锅'], '自助': ['其他火锅', '自助火锅'], '辣': ['其他火锅', '川味火锅'],
               '重庆': ['其他火锅', '川味火锅'], '四川': ['其他火锅', '川味火锅'], '蜀': ['其他火锅', '川味火锅'], '渝': ['其他火锅', '川味火锅'],
               '蝎子': ['其他火锅', '羊蝎子火锅'],
               '羯子': ['其他火锅', '羊蝎子火锅'], '滇': ['其他火锅', '云南火锅'], '云南': ['其他火锅', '云南火锅'], '鱼': ['其他火锅', '鱼火锅'],
               '渔': ['其他火锅', '鱼火锅'],
               '海鲜': ['其他火锅', '海鲜火锅'], '小火锅': ['其他火锅', '小火锅'], '焖锅': ['其他火锅', '焖锅'], '韩': ['其他火锅', '韩式火锅'],
               '年糕': ['其他火锅', '韩式火锅'],
               '串串': ['其他火锅', '串串香'], '铁板烧': ['其他自助餐', '日式自助'], '寿喜烧': ['其他自助餐', '日式自助'], '寿司': ['其他自助餐', '日式自助'],
               '烤肉': ['其他自助餐', '自助烤肉'], '海鲜': ['其他自助餐', '自助海鲜'], '比萨': ['其他自助餐', '自助比萨'], '披萨': ['其他自助餐', '自助比萨'],
               '火锅': ['其他自助餐', '自助火锅'], '翅': ['其他烧烤', '烤翅'], '串': ['其他烧烤', '烤串'], '巴西': ['其他烧烤', '拉美烧烤'],
               '自助': ['其他烧烤', '自助烧烤'],
               '虾': ['其它小吃快餐', '小龙虾'], '粥': ['其它小吃快餐', '粥粉面馆'], '粉': ['其它小吃快餐', '粥粉面馆'], '面': ['其它小吃快餐', '粥粉面馆'],
               '饺': ['其它小吃快餐', '饺子馄饨'], '馄钝': ['其它小吃快餐', '饺子馄饨'], '生煎': ['其它小吃快餐', '生煎锅贴'], '锅贴': ['其它小吃快餐', '生煎锅贴'],
               '刺身': ['其他日本菜', '生鱼片'], '鱼': ['其他日本菜', '生鱼片'], '寿司': ['其他日本菜', '寿司/简餐'], '铁板烧': ['其他日本菜', '日式烧烤/铁板烧'],
               '烧烤': ['其他日本菜', '日式烧烤/铁板烧'], '自助': ['其他日本菜', '日式自助'], '比萨': ['其他西餐', '比萨'], '汉堡': ['其他西餐', '汉堡'],
               '牛排': ['其他西餐', '牛排'],
               '意大利': ['其他西餐', '意大利菜'], '法国': ['其他西餐', '法国菜'], '拉美烧烤': ['其他西餐', '拉美烧烤'], '西班牙': ['其他西餐', '西班牙菜'],
               '俄罗斯': ['其他西餐', '俄罗斯菜'],
               '墨西哥': ['其他西餐', '墨西哥菜'], '土耳其': ['其他西餐', '土耳其菜'], '葡萄牙': ['其他西餐', '葡萄牙菜']}

BRAND_NAME = {'东来顺':['其他火锅', '涮羊肉'],'小肥羊':['其他火锅', '涮羊肉'],'陈记顺':['其他火锅', '牛肉火锅'],
              '豆捞坊':['其他火锅', '小火锅'],'锅内锅外':['其他自助餐', '自助海鲜'],'海底捞':['其他火锅', '川味火锅'],
              '老灶':['其他火锅', '川味火锅'],'宽窄巷子':['其他火锅', '川味火锅'],'九宫格':['其他火锅', '川味火锅'],
              '豪客来':['其他西餐', '牛排'],'好伦哥':['其他自助餐', '自助比萨'],'黑松白鹿':['其他自助餐', '日式自助'],
              '黄记煌':['其他火锅', '焖锅'],'火炉火':['其他火锅', '韩式火锅'],'火宴山':['其他火锅', '自助火锅'],
              '丁丁洋':['其他火锅', '自助火锅'],'将太无二':['其他日本菜', '生鱼片'],'老诚一锅':['其他火锅', '羊蝎子火锅'],
              '香草香草':['其他火锅', '云南火锅'],'新辣道':['其他火锅', '鱼火锅']}

def process(input):
    for line in input:
        try:
            cols = line.strip().split("\t")
        except Exception:
            sys.stderr.write("Error: Split error!!! \n")
            continue

        try:
            poi_name = cols[2]
            back_cate3_name = cols[1]
            brand_name=cols[3]
            front_cate3_name='none'

            print "%s\t%s\t%s\t%s\t%s\t%s\t%s\t%s\t%s\t%s" % (str(cols[0]), str(cols[1]), str(cols[2]), str(cols[3]), str(front_cate3_name),str(cols[0]), str(cols[1]), str(cols[2]), str(cols[3]), str(cols[0]))

        except Exception, e:
            sys.stderr.write(str(e))
            sys.stderr.write("Error: Input error!!!\n")
        continue


if __name__ == '__main__':
    # st,fn=sys.argv
    # with open(fn,'rb') as fr:
    #     process(fr)
    process(sys.stdin)